DROP_COLS = ["No", "市区町村コード", "都道府県名", "地区名", "最寄駅：名称", "取引時点"]

FEATURE_COLS = [
    "種類",
    "地域",
    "市区町村名",
    "最寄駅：距離（分）",
    "取引価格（総額）",
    "坪単価",
    "間取り",
    "面積（㎡）",
    "取引価格（㎡単価）",
    "土地の形状",
    "間口",
    "延床面積（㎡）",
    "建築年",
    "建物の構造",
    "用途",
    "今後の利用目的",
    "前面道路：方位",
    "前面道路：種類",
    "前面道路：幅員（ｍ）",
    "都市計画",
    "建ぺい率（％）",
    "容積率（％）",
    "改装",
    "取引の事情等",
]

TARGET_COL = "取引価格（総額）_over_median"

CATEGORICAL_COLS = [
    "種類",
    "地域",
    "市区町村名",
    "間取り",
    "土地の形状",
    "建物の構造",
    "用途",
    "今後の利用目的",
    "前面道路：方位",
    "前面道路：種類",
    "都市計画",
    "改装",
    "取引の事情等",
]
